IPA_TO_INTERNAL = {
    # consonants
    "p": "p", "b": "b",
    "t": "t", "d": "d",
    "k": "k", "ɡ": "g", "g": "g",
    "f": "f", "v": "v",
    "s": "s", "z": "z",
    "ʃ": "sh", "ʒ": "zh",
    "tʂ": "ch", "tɕ": "ch", "t͡ʃ": "ch", "tʃ": "ch",
    "d͡ʒ": "j", "dʒ": "j",
    "m": "m", "n": "n", "ŋ": "ng",
    "l": "l", "ɹ": "r", "r": "r", "ɾ": "r",
    "w": "w", "j": "y", "h": "h",
    "θ": "th", "ð": "dh",

    # vowels
    "a": "a", "æ": "a", "ɑ": "a", "ʌ": "a", "ə": "a",
    "ɛ": "e", "e": "e",
    "ɪ": "i", "i": "i",
    "ʊ": "u", "u": "u",
    "o": "o", "ɔ": "o", "ɒ": "o",

    # diphthongs
    "aɪ": "ai", "aʊ": "au", "ɔɪ": "oi", "eɪ": "e", "oʊ": "o", "əʊ": "o"
}